<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Uploads Cricut Design Space package to Jamf</string>
	<key>Identifier</key>
	<string>com.github.yoxalld.jamf.CricutDesignSpace</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Media Center</string>
		<key>NAME</key>
		<string>Cricut Design Space</string>
		<key>JCDS_MODE</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.pkg.CricutDesignSpace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
				<key>jcds_mode</key>
				<string>%JCDS_MODE</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
	</array>
</dict>
</plist>
