<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VEXCode V5.</string>
    <key>Identifier</key>
    <string>com.github.yoxalld.download.VEXCodeV5</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VEXCode V5</string>
        <key>DOWNLOAD_URL</key>
        <string>https://link.vex.com/vexcode-v5blocks-mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>prefetch_filename</key>
                <string>True</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.pkg</string>
                <key>requirement</key>
                <string>identifier "com.nw-builder.vexcodev" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>